# Wk2_Exercises_tutorial (with solutions)

Before you start, first import the pandas and NumPy libraries, for example as follows:
```python
import pandas as pd
import numpy as np
```

In [1]:
# Import the libraries

import pandas as pd
import numpy as np

__Q1:__ Suppose you want to combine data from three different data sources for a data analytics project. More specifically, you want to combine these data vertically using the `concat()` method. Before being able to do so, however, you first need to import and clean the data, such that the data is formatted consistently.

The first data source consists of data that you have received on paper, based on which you need to create the following DataFrame (called 'df1'), in which the values for 'Firm age' are included as strings:
```python
	Ticker	Firm age	ROA
0	AA	    15	      0.05
1	BB	    32	      0.09
2	CC	    24	      0.17
```
Create and display this DataFrame. Next, in a separate cell, display general information about the dataset using the `info()` method.

In [2]:
# Create the data

df1 = pd.DataFrame({'Ticker': ['AA', 'BB', 'CC'],
                   'Firm age': ['15', '32', '24'],
                   'ROA': [0.05, 0.09, 0.17]})
display(df1)

  Ticker Firm age   ROA
0     AA       15  0.05
1     BB       32  0.09
2     CC       24  0.17

In [3]:
# Display general information

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Ticker    3 non-null      object
 1   Firm age  3 non-null      object
 2   ROA       3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

__Q2:__ The second data source consists of data that you have received as a CSV file ('df2.csv'). Use the `read_csv()` method to read this file and load it into memory as a DataFrame ('df2'), and display this DataFrame. Next, in a separate cell, display general information about the dataset using the `info()` method.

In [4]:
# Import the data

df2 = pd.read_csv('data/df2.csv')
df2

  Ticker symbol  Firm age  ROA
0            DD        12   6%
1            EE        54  13%
2            FF        36  11%

In [5]:
# Display general information

df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Ticker symbol  3 non-null      object
 1   Firm age       3 non-null      int64
 2   ROA            3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

__Q3:__ When you compare the 'df1' and 'df2' DataFrames, you observe several issues that you need to solve before being able to concatenate them. More specifically, you observe inconsistencies in terms of: (a) the name of the 'ticker' columns, (b) the data type of the 'firm age' columns, and (c) the format and data type of the 'ROA' columns.

Solve these issues by performing the following operations: (a) rename the column 'Ticker symbol' of the 'df2' DataFrame as 'Ticker', (b) convert the data type of the column 'Firm age' of the 'df1' DataFrame to integer, and (c) use the `strip()` and `astype()` methods to remove the % signs from the column 'ROA' of the 'df2' DataFrame and to convert its values to integer, and then multiply these values by 0.01.

In [6]:
# Perform the operations

df2.rename(columns={'Ticker symbol': 'Ticker'}, inplace=True)
df1['Firm age'] = df1['Firm age'].astype(int)
df2['ROA'] = df2['ROA'].str.strip('%').astype(int) * 0.01

__Q4:__ Concatenate the two DataFrames, and display the combined DataFrame (called 'df_comb'). Next, in a separate cell, display general information about the combined dataset using the `info()` method.

In [7]:
# Concatenate the DataFrames

df_comb = pd.concat([df1, df2])
df_comb

  Ticker  Firm age   ROA
0     AA        15  0.05
1     BB        32  0.09
2     CC        24  0.17
0     DD        12  0.06
1     EE        54  0.13
2     FF        36  0.11

In [8]:
# Display general information

df_comb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Ticker    6 non-null      object
 1   Firm age  6 non-null      int64
 2   ROA       6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 192.0+ bytes

__Q5:__ The third data source consists of data that you have received as an Excel file ('df3.xlsx'). Use the `read_excel()` method to read this file and load it into memory as a DataFrame ('df3'), and display this DataFrame. Next, in a separate cell, display general information about the dataset using the `info()` method. (Hint: note that the Excel file contains a footnote that you don't want to import in the DataFrame.)

In [9]:
# Import the data

df3 = pd.read_excel('data/df3.xlsx', skipfooter=2)
df3

  Ticker  Firm age[a] Net income Average total assets
0    AA           180      $5000              $100000
1    BB           384     $18000              $200000
2    GG           240     $12000              $180000
3    HH           144     $15000              $240000

In [10]:
# Display general information

df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Ticker                4 non-null      object
 1   Firm age[a]           4 non-null      int64
 2   Net income            4 non-null      object
 3   Average total assets  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

__Q6:__ When you compare the 'df_comb' and 'df3' DataFrames, you observe several issues that you need to solve before being able to concatenate them. More specifically, you observe inconsistencies in terms of: (a) the name of the 'firm age' columns, (b) the values of the 'firm age' columns (either in years or months), and (c) whether ROA is included or its constituent parts (i.e., net income and average total assets).

Solve these issues by performing the following operations: (a) rename the column 'Firm age[a]' of the 'df3' DataFrame as 'Firm age', (b) divide the column 'Firm age' of the 'df3' DataFrame by 12, and convert its values to integer, (c) use the `strip()` method to remove the $ signs from the columns 'Net income' and 'Average total assets' of the 'df3' DataFrame, convert their values to integer, and then create a new variable ('ROA'), rounded to two digits, by dividing 'Net income' by 'Average total assets'. Next, drop the columns 'Net income' and 'Average total assets' from the 'df3' DataFrame, and display the DataFrame.

In [11]:
# Perform the operations

df3.rename(columns={'Firm age[a]': 'Firm age'}, inplace=True)
df3['Firm age'] = (df3['Firm age'] / 12).astype(int)
df3['Net income'] = df3['Net income'].str.strip('$').astype(int)
df3['Average total assets'] = df3['Average total assets'].str.strip('$').astype(int)
df3['ROA'] = round(df3['Net income'] / df3['Average total assets'], 2)
df3.drop(['Net income', 'Average total assets'], axis=1, inplace=True)
df3

  Ticker  Firm age   ROA
0    AA         15  0.05
1    BB         32  0.09
2    GG         20  0.07
3    HH         12  0.06

__Q7:__ Concatenate the 'df_comb' and 'df3' DataFrames, and display the combined DataFrame (called 'df_comb2'). Next, in a separate cell, display general information about the dataset using the `info()` method.

In [12]:
# Concatenate the DataFrames

df_comb2 = pd.concat([df_comb, df3], ignore_index=True)
df_comb2

  Ticker  Firm age   ROA
0     AA        15  0.05
1     BB        32  0.09
2     CC        24  0.17
3     DD        12  0.06
4     EE        54  0.13
5     FF        36  0.11
6    AA         15  0.05
7    BB         32  0.09
8    GG         20  0.07
9    HH         12  0.06

__Note:__ It regularly happens that a dataset contains duplicate rows. The pandas library has several methods to deal with this issue, in particular `duplicated()` and `drop_dublicates()`. Visit the online pandas documentation (at: https://pandas.pydata.org/docs/reference/frame.html) to search for and read about these methods.

__Q8:__ When you inspect the combined DataFrame ('df_comb2'), you observe that there seem to be duplicate rows. Use the `duplicated()` method to check whether there are indeed duplicate rows.

In [13]:
# Check for duplicate rows

df_comb2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

__Q9:__ To your surprise(?), this procedure suggests that there are no duplicate rows, but clearly there are some. Use the `values` attribute to check the values in the DataFrame to see whether you can discover how this is possible.

In [14]:
# Display the values

df_comb2.values

array([['AA', 15, 0.05],
       ['BB', 32, 0.09],
       ['CC', 24, 0.17],
       ['DD', 12, 0.06],
       ['EE', 54, 0.13],
       ['FF', 36, 0.11],
       [' AA ', 15, 0.05],
       [' BB ', 32, 0.09],
       [' GG ', 20, 0.07],
       [' HH ', 12, 0.06]], dtype=object)

__Q10:__ It turns out that it is caused by the fact that the tickers of the entries that originate from the 'df3' DataFrame contain leading and trailing spaces. Use the `strip()` method to remove these spaces, and display the values again.

In [15]:
# Remove the spaces and display the values

df_comb2['Ticker'] = df_comb2['Ticker'].str.strip()
df_comb2.values

array([['AA', 15, 0.05],
       ['BB', 32, 0.09],
       ['CC', 24, 0.17],
       ['DD', 12, 0.06],
       ['EE', 54, 0.13],
       ['FF', 36, 0.11],
       ['AA', 15, 0.05],
       ['BB', 32, 0.09],
       ['GG', 20, 0.07],
       ['HH', 12, 0.06]], dtype=object)

__Q11:__ Now perform the following operations: (a) use the `duplicated()` method to return a boolean Series denoting duplicate rows, (b) use the `duplicated()` and `sum()` methods to count the number of duplicate rows, (c) use the bracket operator to display the duplicate rows, and (d) use the `drop_dublicates()` method to drop the duplicate rows and return the final DataFrame (i.e., without the duplicate rows).

In [16]:
# Check for duplicate rows

df_comb2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [17]:
# Count the number of duplicate rows

df_comb2.duplicated().sum()

2

In [18]:
# Display the duplicate rows

df_comb2[df_comb2.duplicated()]

  Ticker  Firm age   ROA
6     AA        15  0.05
7     BB        32  0.09

In [19]:
# Drop the duplicate rows

df_comb2.drop_duplicates(inplace=True)
df_comb2

  Ticker  Firm age   ROA
0     AA        15  0.05
1     BB        32  0.09
2     CC        24  0.17
3     DD        12  0.06
4     EE        54  0.13
5     FF        36  0.11
8     GG        20  0.07
9     HH        12  0.06

__Q12:__ Perform the following calculations using the 'df_comb2' DataFrame: (a) use the `mean()` method to calculate the average 'Firm age' and 'ROA' for the eight firms, (b) use the `mean()` method to calculate the average 'Firm age' and 'ROA' for the two firms whose age is equal to 12, and (c) use the `mean()` method to calculate the average 'Firm age' and 'ROA' for the firms whose age is smaller than 25.

In [20]:
# Calculate the averages

df_comb2[['Firm age', 'ROA']].mean()

Firm age    25.6250
ROA          0.0925
dtype: float64

In [21]:
# Calculate the averages

df_comb2[df_comb2['Firm age'] == 12][['Firm age', 'ROA']].mean()

Firm age    12.00
ROA          0.06
dtype: float64

In [22]:
# Calculate the averages

df_comb2[df_comb2['Firm age'] < 25][['Firm age', 'ROA']].mean()

Firm age    16.600
ROA          0.082
dtype: float64

__Q13:__ Perform the following operations using the 'df_comb2' DataFrame: (a) sort (and display) the DataFrame by 'ROA' from the highest to the lowest values, and (b) sort the DataFrame by 'Firm age' from the lowest to the highest values, and display it such that the variables are shown as the rows and the firms are shown as the columns.

In [23]:
# Sort the DataFrame by 'ROA'

df_comb2.sort_values(by=['ROA'], ascending=False)

  Ticker  Firm age   ROA
2     CC        24  0.17
4     EE        54  0.13
5     FF        36  0.11
1     BB        32  0.09
8     GG        20  0.07
3     DD        12  0.06
9     HH        12  0.06
0     AA        15  0.05

In [24]:
# Sort the DataFrame by 'firm age', and transpose it

df_comb2.sort_values(by=['Firm age']).T

             3     9     0     8     2     1     5     4
Ticker      DD    HH    AA    GG    CC    BB    FF    EE
Firm age    12    12    15    20    24    32    36    54
ROA       0.06  0.06  0.05  0.07  0.17  0.09  0.11  0.13